Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1150/periph/PERI_LCDIFV2.h
#define LCDIFV2_INT_STATUS_DMA_ERR_MASK          (0xFF00U)
#define LCDIFV2_INT_STATUS_DMA_ERR_SHIFT         (8U)
/*! DMA_ERR - Interrupt flag to indicate that which PLANE has Read Error on the AXI interface */
#define LCDIFV2_INT_STATUS_DMA_ERR(x)            (((uint32_t)(((uint32_t)(x)) << LCDIFV2_INT_STATUS_DMA_ERR_SHIFT)) & LCDIFV2_INT_STATUS_DMA_ERR_MASK)

#define LCDIFV2_INT_STATUS_DMA_DONE_MASK         (0xFF0000U)
#define LCDIFV2_INT_STATUS_DMA_DONE_SHIFT        (16U)
/*! DMA_DONE - Interrupt flag to indicate that which PLANE has fetched the last pixel from memory */
#define LCDIFV2_INT_STATUS_DMA_DONE(x)           (((uint32_t)(((uint32_t)(x)) << LCDIFV2_INT_STATUS_DMA_DONE_SHIFT)) & LCDIFV2_INT_STATUS_DMA_DONE_MASK)

#define LCDIFV2_INT_STATUS_FIFO_EMPTY_MASK       (0xFF000000U)
#define LCDIFV2_INT_STATUS_FIFO_EMPTY_SHIFT      (24U)
/*! FIFO_EMPTY - Interrupt flag to indicate that which FIFO in the pixel blending underflowed */
#define LCDIFV2_INT_STATUS_FIFO_EMPTY(x)         (((uint32_t)(((uint32_t)(x)) << LCDIFV2_INT_STATUS_FIFO_EMPTY_SHIFT)) & LCDIFV2_INT_STATUS_FIFO_EMPTY_MASK)
/*! @} */

/* The count of LCDIFV2_INT_STATUS */
#define LCDIFV2_INT_STATUS_COUNT                 (2U)

/*! @name INT_ENABLE - Interrupt Enable Register for domain 0..Interrupt Enable Register for domain 1 */
/*! @{ */

#define LCDIFV2_INT_ENABLE_VSYNC_EN_MASK         (0x1U)
#define LCDIFV2_INT_ENABLE_VSYNC_EN_SHIFT        (0U)
/*! VSYNC_EN - Enable Interrupt flag to indicate that the vertical synchronization phase(The beginning of a frame)
 *  0b0..VSYNC interrupt disable
 *  0b1..VSYNC interrupt enable
 */
#define LCDIFV2_INT_ENABLE_VSYNC_EN(x)           (((uint32_t)(((uint32_t)(x)) << LCDIFV2_INT_ENABLE_VSYNC_EN_SHIFT)) & LCDIFV2_INT_ENABLE_VSYNC_EN_MASK)

#define LCDIFV2_INT_ENABLE_UNDERRUN_EN_MASK      (0x2U)
#define LCDIFV2_INT_ENABLE_UNDERRUN_EN_SHIFT     (1U)
/*! UNDERRUN_EN - Enable Interrupt flag to indicate the output buffer underrun condition
 *  0b0..Output buffer underrun disable
 *  0b1..Output buffer underrun enable
 */
#define LCDIFV2_INT_ENABLE_UNDERRUN_EN(x)        (((uint32_t)(((uint32_t)(x)) << LCDIFV2_INT_ENABLE_UNDERRUN_EN_SHIFT)) & LCDIFV2_INT_ENABLE_UNDERRUN_EN_MASK)

#define LCDIFV2_INT_ENABLE_VS_BLANK_EN_MASK      (0x4U)
#define LCDIFV2_INT_ENABLE_VS_BLANK_EN_SHIFT     (2U)
/*! VS_BLANK_EN - Enable Interrupt flag to indicate vertical blanking period
 *  0b0..Vertical blanking start interrupt disable
 *  0b1..Vertical blanking start interrupt enable
 */
#define LCDIFV2_INT_ENABLE_VS_BLANK_EN(x)        (((uint32_t)(((uint32_t)(x)) << LCDIFV2_INT_ENABLE_VS_BLANK_EN_SHIFT)) & LCDIFV2_INT_ENABLE_VS_BLANK_EN_MASK)

#define LCDIFV2_INT_ENABLE_DMA_ERR_EN_MASK       (0xFF00U)
#define LCDIFV2_INT_ENABLE_DMA_ERR_EN_SHIFT      (8U)
/*! DMA_ERR_EN - Enable Interrupt flag to indicate that which PLANE has Read Error on the AXI interface */
#define LCDIFV2_INT_ENABLE_DMA_ERR_EN(x)         (((uint32_t)(((uint32_t)(x)) << LCDIFV2_INT_ENABLE_DMA_ERR_EN_SHIFT)) & LCDIFV2_INT_ENABLE_DMA_ERR_EN_MASK)

#define LCDIFV2_INT_ENABLE_DMA_DONE_EN_MASK      (0xFF0000U)
#define LCDIFV2_INT_ENABLE_DMA_DONE_EN_SHIFT     (16U)
/*! DMA_DONE_EN - Enable Interrupt flag to indicate that which PLANE has fetched the last pixel from memory */
#define LCDIFV2_INT_ENABLE_DMA_DONE_EN(x)        (((uint32_t)(((uint32_t)(x)) << LCDIFV2_INT_ENABLE_DMA_DONE_EN_SHIFT)) & LCDIFV2_INT_ENABLE_DMA_DONE_EN_MASK)

#define LCDIFV2_INT_ENABLE_FIFO_EMPTY_EN_MASK    (0xFF000000U)
#define LCDIFV2_INT_ENABLE_FIFO_EMPTY_EN_SHIFT   (24U)
/*! FIFO_EMPTY_EN - Enable Interrupt flag to indicate that which FIFO in the pixel blending underflowed */
#define LCDIFV2_INT_ENABLE_FIFO_EMPTY_EN(x)      (((uint32_t)(((uint32_t)(x)) << LCDIFV2_INT_ENABLE_FIFO_EMPTY_EN_SHIFT)) & LCDIFV2_INT_ENABLE_FIFO_EMPTY_EN_MASK)
/*! @} */

/* The count of LCDIFV2_INT_ENABLE */
#define LCDIFV2_INT_ENABLE_COUNT                 (2U)

/*! @name CTRLDESCL1 - Control Descriptor Layer 1 Register */
/*! @{ */

#define LCDIFV2_CTRLDESCL1_WIDTH_MASK            (0xFFFU)
#define LCDIFV2_CTRLDESCL1_WIDTH_SHIFT           (0U)
/*! WIDTH - Width of the layer in pixels */
#define LCDIFV2_CTRLDESCL1_WIDTH(x)              (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL1_WIDTH_SHIFT)) & LCDIFV2_CTRLDESCL1_WIDTH_MASK)

#define LCDIFV2_CTRLDESCL1_HEIGHT_MASK           (0xFFF0000U)
#define LCDIFV2_CTRLDESCL1_HEIGHT_SHIFT          (16U)
/*! HEIGHT - Height of the layer in pixels */
#define LCDIFV2_CTRLDESCL1_HEIGHT(x)             (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL1_HEIGHT_SHIFT)) & LCDIFV2_CTRLDESCL1_HEIGHT_MASK)
/*! @} */

/* The count of LCDIFV2_CTRLDESCL1 */
#define LCDIFV2_CTRLDESCL1_COUNT                 (8U)

/*! @name CTRLDESCL2 - Control Descriptor Layer 2 Register */
/*! @{ */

#define LCDIFV2_CTRLDESCL2_POSX_MASK             (0xFFFU)
#define LCDIFV2_CTRLDESCL2_POSX_SHIFT            (0U)
/*! POSX - POS X */
#define LCDIFV2_CTRLDESCL2_POSX(x)               (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL2_POSX_SHIFT)) & LCDIFV2_CTRLDESCL2_POSX_MASK)

#define LCDIFV2_CTRLDESCL2_POSY_MASK             (0xFFF0000U)
#define LCDIFV2_CTRLDESCL2_POSY_SHIFT            (16U)
/*! POSY - The vertical position of top row of the layer, where 0 is the top row of the panel, only
 *    positive values are below the top row of the panel
 */
#define LCDIFV2_CTRLDESCL2_POSY(x)               (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL2_POSY_SHIFT)) & LCDIFV2_CTRLDESCL2_POSY_MASK)
/*! @} */

/* The count of LCDIFV2_CTRLDESCL2 */
#define LCDIFV2_CTRLDESCL2_COUNT                 (8U)

/*! @name CTRLDESCL3 - Control Descriptor Layer 3 Register */
/*! @{ */

#define LCDIFV2_CTRLDESCL3_PITCH_MASK            (0xFFFFU)
#define LCDIFV2_CTRLDESCL3_PITCH_SHIFT           (0U)
/*! PITCH - Number of bytes between 2 vertically adjacent pixels in system memory. Byte granularity
 *    is supported, but SW should align to 64B boundry
 */
#define LCDIFV2_CTRLDESCL3_PITCH(x)              (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CTRLDESCL3_PITCH_SHIFT)) & LCDIFV2_CTRLDESCL3_PITCH_MASK)
/*! @} */

