Masmiseim36/iMXRT/targets/iMXRT/devices/iMXRT1150/periph/PERI_LCDIFV2.h
#define LCDIFV2_CSC_COEF0_ENABLE_MASK            (0x40000000U)
#define LCDIFV2_CSC_COEF0_ENABLE_SHIFT           (30U)
/*! ENABLE - Enable the CSC unit in the LCDIFv2 plane data path
 *  0b0..The CSC is bypassed and the input pixels are RGB data already
 *  0b1..The CSC is enabled and the pixels will be converted to RGB data
 */
#define LCDIFV2_CSC_COEF0_ENABLE(x)              (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CSC_COEF0_ENABLE_SHIFT)) & LCDIFV2_CSC_COEF0_ENABLE_MASK)

#define LCDIFV2_CSC_COEF0_YCBCR_MODE_MASK        (0x80000000U)
#define LCDIFV2_CSC_COEF0_YCBCR_MODE_SHIFT       (31U)
/*! YCBCR_MODE - This bit changes the behavior when performing U/V converting
 *  0b0..Converting YUV to RGB data
 *  0b1..Converting YCbCr to RGB data
 */
#define LCDIFV2_CSC_COEF0_YCBCR_MODE(x)          (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CSC_COEF0_YCBCR_MODE_SHIFT)) & LCDIFV2_CSC_COEF0_YCBCR_MODE_MASK)
/*! @} */

/* The count of LCDIFV2_CSC_COEF0 */
#define LCDIFV2_CSC_COEF0_COUNT                  (8U)

/*! @name CSC_COEF1 - Color Space Conversion Coefficient Register 1 */
/*! @{ */

#define LCDIFV2_CSC_COEF1_C4_MASK                (0x7FFU)
#define LCDIFV2_CSC_COEF1_C4_SHIFT               (0U)
/*! C4 - Two's compliment Blue U/Cb multiplier coefficient. YUV=0x208 (2.032) YCbCr=0x204 (2.017) */
#define LCDIFV2_CSC_COEF1_C4(x)                  (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CSC_COEF1_C4_SHIFT)) & LCDIFV2_CSC_COEF1_C4_MASK)

#define LCDIFV2_CSC_COEF1_C1_MASK                (0x7FF0000U)
#define LCDIFV2_CSC_COEF1_C1_SHIFT               (16U)
/*! C1 - Two's compliment Red V/Cr multiplier coefficient. YUV=0x123 (1.140) YCbCr=0x198 (1.596) */
#define LCDIFV2_CSC_COEF1_C1(x)                  (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CSC_COEF1_C1_SHIFT)) & LCDIFV2_CSC_COEF1_C1_MASK)
/*! @} */

/* The count of LCDIFV2_CSC_COEF1 */
#define LCDIFV2_CSC_COEF1_COUNT                  (8U)

/*! @name CSC_COEF2 - Color Space Conversion Coefficient Register 2 */
/*! @{ */

#define LCDIFV2_CSC_COEF2_C3_MASK                (0x7FFU)
#define LCDIFV2_CSC_COEF2_C3_SHIFT               (0U)
/*! C3 - Two's compliment Green U/Cb multiplier coefficient. YUV=0x79C (-0.394) YCbCr=0x79C (-0.392) */
#define LCDIFV2_CSC_COEF2_C3(x)                  (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CSC_COEF2_C3_SHIFT)) & LCDIFV2_CSC_COEF2_C3_MASK)

#define LCDIFV2_CSC_COEF2_C2_MASK                (0x7FF0000U)
#define LCDIFV2_CSC_COEF2_C2_SHIFT               (16U)
/*! C2 - Two's compliment Green V/Cr multiplier coefficient. YUV=0x76B (-0.581) YCbCr=0x730 (-0.813) */
#define LCDIFV2_CSC_COEF2_C2(x)                  (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CSC_COEF2_C2_SHIFT)) & LCDIFV2_CSC_COEF2_C2_MASK)
/*! @} */

/* The count of LCDIFV2_CSC_COEF2 */
#define LCDIFV2_CSC_COEF2_COUNT                  (8U)

/*! @name CLUT_LOAD - LCDIFv2 CLUT load Register */
/*! @{ */

#define LCDIFV2_CLUT_LOAD_CLUT_UPDATE_EN_MASK    (0x1U)
#define LCDIFV2_CLUT_LOAD_CLUT_UPDATE_EN_SHIFT   (0U)
/*! CLUT_UPDATE_EN - CLUT Update Enable */
#define LCDIFV2_CLUT_LOAD_CLUT_UPDATE_EN(x)      (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CLUT_LOAD_CLUT_UPDATE_EN_SHIFT)) & LCDIFV2_CLUT_LOAD_CLUT_UPDATE_EN_MASK)

#define LCDIFV2_CLUT_LOAD_SEL_CLUT_NUM_MASK      (0x70U)
#define LCDIFV2_CLUT_LOAD_SEL_CLUT_NUM_SHIFT     (4U)
/*! SEL_CLUT_NUM - Selected CLUT Number */
#define LCDIFV2_CLUT_LOAD_SEL_CLUT_NUM(x)        (((uint32_t)(((uint32_t)(x)) << LCDIFV2_CLUT_LOAD_SEL_CLUT_NUM_SHIFT)) & LCDIFV2_CLUT_LOAD_SEL_CLUT_NUM_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group LCDIFV2_Register_Masks */


/*!
 * @}
 */ /* end of group LCDIFV2_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__CWCC__)
  #pragma pop
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_LCDIFV2_H_ */

